In [2]:
import pandas as pd
import json
import os



#aggregated insurance

path1="C:/Users/Admin/Downloads/pulse-master/pulse-master/data/aggregated/insurance/country/india/state/"
Agg_insu_list=os.listdir(path1)
Agg_insu_list




clm1={'State':[], 'Year':[],'Quater':[],'Transacion_type':[], 'Transacion_count':[], 'Transacion_amount':[]}

for i in Agg_insu_list:
    p_i=path1+i+"/"
    Agg_yr=os.listdir(p_i)
    for j in Agg_yr:
        p_j=p_i+j+"/"
        Agg_yr_list=os.listdir(p_j)
        for k in Agg_yr_list:
            p_k=p_j+k
            Data=open(p_k,'r')
            C=json.load(Data)
            for z in C['data']['transactionData']:
              Name=z['name']
              count=z['paymentInstruments'][0]['count']
              amount=z['paymentInstruments'][0]['amount']
              clm1['Transacion_type'].append(Name)
              clm1['Transacion_count'].append(count)
              clm1['Transacion_amount'].append(amount)
              clm1['State'].append(i)
              clm1['Year'].append(j)
              clm1['Quater'].append(int(k.strip('.json')))

Agg_insu=pd.DataFrame(clm1)


Agg_insu['State']=Agg_insu['State'].str.replace('andaman-&-nicobar-islands','Andaman & Nicobar')
Agg_insu['State']=Agg_insu['State'].str.replace('-',' ')
Agg_insu['State']=Agg_insu['State'].str.title()
Agg_insu['State']=Agg_insu['State'].str.replace('Dadra & Nagar Haveli & Daman & Diu','Dadra and Nagar Haveli and Daman and Diu')

In [3]:
Agg_insu

,State,Year,Quater,Transacion_type,Transacion_count,Transacion_amount
0,Andaman & Nicobar,2020,2,Insurance,6,1360.0
1,Andaman & Nicobar,2020,3,Insurance,41,15380.0
2,Andaman & Nicobar,2020,4,Insurance,124,157975.0
3,Andaman & Nicobar,2021,1,Insurance,225,244266.0
4,Andaman & Nicobar,2021,2,Insurance,137,181504.0
...,...,...,...,...,...,...
677,West Bengal,2023,4,Insurance,72712,100365562.0
678,West Bengal,2024,1,Insurance,79576,104987909.0
679,West Bengal,2024,2,Insurance,67048,89476633.0
680,West Bengal,2024,3,Insurance,77158,107451766.0
681,West Bengal,2024,4,Insurance,91719,120602777.0

In [4]:


#aggregated transaction

path2="C:/Users/Admin/Downloads/pulse-master/pulse-master/data/aggregated/transaction/country/india/state/"
Agg_trans_list=os.listdir(path2)
Agg_trans_list


clm2={'State':[], 'Year':[],'Quater':[],'Transacion_type':[], 'Transacion_count':[], 'Transacion_amount':[]}

for i in Agg_trans_list:
    p_i=path2+i+"/"
    Agg_yr=os.listdir(p_i)
    for j in Agg_yr:
        p_j=p_i+j+"/"
        Agg_yr_list=os.listdir(p_j)
        for k in Agg_yr_list:
            p_k=p_j+k
            Data=open(p_k,'r')
            A=json.load(Data)
            for z in A['data']['transactionData']:
              Name=z['name']
              count=z['paymentInstruments'][0]['count']
              amount=z['paymentInstruments'][0]['amount']
              clm2['Transacion_type'].append(Name)
              clm2['Transacion_count'].append(count)
              clm2['Transacion_amount'].append(amount)
              clm2['State'].append(i)
              clm2['Year'].append(j)
              clm2['Quater'].append(int(k.strip('.json')))

Agg_Trans=pd.DataFrame(clm2)


Agg_Trans['State']=Agg_Trans['State'].str.replace('andaman-&-nicobar-islands','Andaman & Nicobar')
Agg_Trans['State']=Agg_Trans['State'].str.replace('-',' ')
Agg_Trans['State']=Agg_Trans['State'].str.title()
Agg_Trans['State']=Agg_Trans['State'].str.replace('Dadra & Nagar Haveli & Daman & Diu','Dadra and Nagar Haveli and Daman and Diu')

In [5]:
Agg_Trans

,State,Year,Quater,Transacion_type,Transacion_count,Transacion_amount
0,Andaman & Nicobar,2018,1,Recharge & bill payments,4200,1.845307e+06
1,Andaman & Nicobar,2018,1,Peer-to-peer payments,1871,1.213866e+07
2,Andaman & Nicobar,2018,1,Merchant payments,298,4.525072e+05
3,Andaman & Nicobar,2018,1,Financial Services,33,1.060142e+04
4,Andaman & Nicobar,2018,1,Others,256,1.846899e+05
...,...,...,...,...,...,...
5029,West Bengal,2024,4,Merchant payments,655100809,3.892862e+11
5030,West Bengal,2024,4,Peer-to-peer payments,493217788,1.361927e+12
5031,West Bengal,2024,4,Recharge & bill payments,76043195,5.753406e+10
5032,West Bengal,2024,4,Financial Services,2352084,8.472965e+08
5033,West Bengal,2024,4,Others,421806,5.053641e+08

In [7]:

#aggregated user

path3="C:/Users/Admin/Downloads/pulse-master/pulse-master/data/aggregated/user/country/india/state/"
Agg_user_list=os.listdir(path3)
Agg_user_list


clm3={'State':[], 'Year':[],'Quater':[],'Brands':[], 'Transacion_count':[], 'Percentage':[]}

for i in Agg_user_list:
    p_i=path3+i+"/"
    Agg_yr=os.listdir(p_i)
    for j in Agg_yr:
        p_j=p_i+j+"/"
        Agg_yr_list=os.listdir(p_j)
        for k in Agg_yr_list:
            p_k=p_j+k
            Data=open(p_k,'r')
            B=json.load(Data)

            try:
                 for z in B['data']['usersByDevice']:
                   brand=z['brand']
                   count=z['count']
                   percentage=z['percentage']
                   clm3['Brands'].append(brand)
                   clm3['Transacion_count'].append(count)
                   clm3['Percentage'].append(percentage)
                   clm3['State'].append(i)
                   clm3['Year'].append(j)
                   clm3['Quater'].append(int(k.strip('.json')))
            except:
                pass
                     

Agg_user=pd.DataFrame(clm3)

Agg_user['State']=Agg_user['State'].str.replace('andaman-&-nicobar-islands','Andaman & Nicobar')
Agg_user['State']=Agg_user['State'].str.replace('-',' ')
Agg_user['State']=Agg_user['State'].str.title()
Agg_user['State']=Agg_user['State'].str.replace('Dadra & Nagar Haveli & Daman & Diu','Dadra and Nagar Haveli and Daman and Diu')

In [8]:
Agg_user.columns

Index(['State', 'Year', 'Quater', 'Brands', 'Transacion_count', 'Percentage'], dtype='object')

In [9]:
Agg_user

                  State  Year  Quater   Brands  Transacion_count  Percentage
0     Andaman & Nicobar  2018       1   Xiaomi              1665    0.247033
1     Andaman & Nicobar  2018       1  Samsung              1445    0.214392
2     Andaman & Nicobar  2018       1     Vivo               982    0.145697
3     Andaman & Nicobar  2018       1     Oppo               501    0.074332
4     Andaman & Nicobar  2018       1  OnePlus               332    0.049258
...                 ...   ...     ...      ...               ...         ...
6727        West Bengal  2022       1   Lenovo            330017    0.015056
6728        West Bengal  2022       1  Infinix            284678    0.012987
6729        West Bengal  2022       1     Asus            280347    0.012790
6730        West Bengal  2022       1    Apple            277752    0.012671
6731        West Bengal  2022       1   Others           2196334    0.100199

[6732 rows x 6 columns]

In [10]:

#map insurance

path4="C:/Users/Admin/Downloads/pulse-master/pulse-master/data/map/insurance/hover/country/india/state/"
map_insu_list=os.listdir(path4)
map_insu_list


clm4={'State':[], 'Year':[],'Quater':[],'Districts':[], 'Transacion_count':[], 'Transacion_amount':[]}

for i in map_insu_list:
    p_i=path4+i+"/"
    map_yr=os.listdir(p_i)
    for j in map_yr:
        p_j=p_i+j+"/"
        map_yr_list=os.listdir(p_j)
        for k in map_yr_list:
            p_k=p_j+k
            Data=open(p_k,'r')
            D=json.load(Data)
            for z in D['data']['hoverDataList']:
              name=z['name']
              count=z['metric'][0]['count']
              amount=z['metric'][0]['amount']
              clm4['Districts'].append(name)
              clm4['Transacion_count'].append(count)
              clm4['Transacion_amount'].append(amount)
              clm4['State'].append(i)
              clm4['Year'].append(j)
              clm4['Quater'].append(int(k.strip('.json')))


map_insu=pd.DataFrame(clm4)

map_insu['State']=map_insu['State'].str.replace('andaman-&-nicobar-islands','Andaman & Nicobar')
map_insu['State']=map_insu['State'].str.replace('-',' ')
map_insu['State']=map_insu['State'].str.title()
map_insu['State']=map_insu['State'].str.replace('Dadra & Nagar Haveli & Daman & Diu','Dadra and Nagar Haveli and Daman and Diu')

In [11]:
map_insu

,State,Year,Quater,Districts,Transacion_count,Transacion_amount
0,Andaman & Nicobar,2020,2,south andaman district,3,795.0
1,Andaman & Nicobar,2020,2,nicobars district,3,565.0
2,Andaman & Nicobar,2020,3,north and middle andaman district,1,281.0
3,Andaman & Nicobar,2020,3,south andaman district,35,13651.0
4,Andaman & Nicobar,2020,3,nicobars district,5,1448.0
...,...,...,...,...,...,...
13871,West Bengal,2024,4,alipurduar district,1023,1613143.0
13872,West Bengal,2024,4,paschim bardhaman district,4945,7005851.0
13873,West Bengal,2024,4,nadia district,3807,5031294.0
13874,West Bengal,2024,4,birbhum district,1818,2423290.0
13875,West Bengal,2024,4,purba medinipur district,3559,4439061.0

In [12]:
#map trancation


path5="C:/Users/Admin/Downloads/pulse-master/pulse-master/data/map/transaction/hover/country/india/state/"
map_tran_list=os.listdir(path5)
map_tran_list


clm5={'State':[], 'Year':[],'Quater':[],'Districts':[], 'Transacion_count':[], 'Transacion_amount':[]}

for i in map_tran_list:
    p_i=path5+i+"/"
    map_yr=os.listdir(p_i)
    for j in map_yr:
        p_j=p_i+j+"/"
        map_yr_list=os.listdir(p_j)
        for k in map_yr_list:
            p_k=p_j+k
            Data=open(p_k,'r')
            E=json.load(Data)
            for z in E['data']['hoverDataList']:
              name=z['name']
              count=z['metric'][0]['count']
              amount=z['metric'][0]['amount']
              clm5['Districts'].append(name)
              clm5['Transacion_count'].append(count)
              clm5['Transacion_amount'].append(amount)
              clm5['State'].append(i)
              clm5['Year'].append(j)
              clm5['Quater'].append(int(k.strip('.json')))


map_tran=pd.DataFrame(clm5)

map_tran['State']=map_tran['State'].str.replace('andaman-&-nicobar-islands','Andaman & Nicobar')
map_tran['State']=map_tran['State'].str.replace('-',' ')
map_tran['State']=map_tran['State'].str.title()
map_tran['State']=map_tran['State'].str.replace('Dadra & Nagar Haveli & Daman & Diu','Dadra and Nagar Haveli and Daman and Diu')

In [13]:
map_tran

,State,Year,Quater,Districts,Transacion_count,Transacion_amount
0,Andaman & Nicobar,2018,1,north and middle andaman district,442,9.316631e+05
1,Andaman & Nicobar,2018,1,south andaman district,5688,1.256025e+07
2,Andaman & Nicobar,2018,1,nicobars district,528,1.139849e+06
3,Andaman & Nicobar,2018,2,north and middle andaman district,825,1.317863e+06
4,Andaman & Nicobar,2018,2,south andaman district,9395,2.394824e+07
...,...,...,...,...,...,...
20599,West Bengal,2024,4,alipurduar district,15875637,2.099251e+10
20600,West Bengal,2024,4,paschim bardhaman district,56616799,6.968735e+10
20601,West Bengal,2024,4,nadia district,65274337,1.079320e+11
20602,West Bengal,2024,4,birbhum district,36905213,5.778701e+10
20603,West Bengal,2024,4,purba medinipur district,67833775,1.142771e+11

In [14]:
#map user



path6="C:/Users/Admin/Downloads/pulse-master/pulse-master/data/map/user/hover/country/india/state/"
map_user_list=os.listdir(path6)
map_user_list


clm6={'State':[], 'Year':[],'Quater':[],'Districts':[], 'RegisteredUsers':[], 'AppOpens':[]}

for i in map_user_list:
    p_i=path6+i+"/"
    map_yr=os.listdir(p_i)
    for j in map_yr:
        p_j=p_i+j+"/"
        map_yr_list=os.listdir(p_j)
        for k in map_yr_list:
            p_k=p_j+k
            Data=open(p_k,'r')
            F=json.load(Data)
            for z in F['data']['hoverData'].items():
              Districts=z[0]
              registeredUsers=z[1]['registeredUsers']
              appOpens=z[1]['appOpens']
              clm6['Districts'].append(Districts)
              clm6['RegisteredUsers'].append(registeredUsers)
              clm6['AppOpens'].append(appOpens)
              clm6['State'].append(i)
              clm6['Year'].append(j)
              clm6['Quater'].append(int(k.strip('.json')))
            
map_user=pd.DataFrame(clm6)   


map_user['State']=map_user['State'].str.replace('andaman-&-nicobar-islands','Andaman & Nicobar')
map_user['State']=map_user['State'].str.replace('-',' ')
map_user['State']=map_user['State'].str.title()
map_user['State']=map_user['State'].str.replace('Dadra & Nagar Haveli & Daman & Diu','Dadra and Nagar Haveli and Daman and Diu')

In [15]:
map_user

,State,Year,Quater,Districts,RegisteredUsers,AppOpens
0,Andaman & Nicobar,2018,1,north and middle andaman district,632,0
1,Andaman & Nicobar,2018,1,south andaman district,5846,0
2,Andaman & Nicobar,2018,1,nicobars district,262,0
3,Andaman & Nicobar,2018,2,north and middle andaman district,911,0
4,Andaman & Nicobar,2018,2,south andaman district,8143,0
...,...,...,...,...,...,...
20603,West Bengal,2024,4,alipurduar district,475688,31842355
20604,West Bengal,2024,4,paschim bardhaman district,1468252,80543469
20605,West Bengal,2024,4,nadia district,1861738,98740305
20606,West Bengal,2024,4,birbhum district,1114220,73465525
20607,West Bengal,2024,4,purba medinipur district,1717074,108350777

In [16]:

#top insurance

path7="C:/Users/Admin/Downloads/pulse-master/pulse-master/data/top/insurance/country/india/state/"
top_insu_list=os.listdir(path7)
top_insu_list


clm7={'State':[], 'Year':[],'Quater':[],'Pincodes':[], 'Transacion_count':[], 'Transacion_amount':[]}

for i in top_insu_list:
    p_i=path7+i+"/"
    top_yr=os.listdir(p_i)
    for j in top_yr:
        p_j=p_i+j+"/"
        top_yr_list=os.listdir(p_j)
        for k in top_yr_list:
            p_k=p_j+k
            Data=open(p_k,'r')
            G=json.load(Data)
            for z in G['data']['pincodes']:
              entityName=z['entityName']
              count=z['metric']['count']
              amount=z['metric']['amount']
              clm7['Pincodes'].append(entityName)
              clm7['Transacion_count'].append(count)
              clm7['Transacion_amount'].append(amount)
              clm7['State'].append(i)
              clm7['Year'].append(j)
              clm7['Quater'].append(int(k.strip('.json')))

top_insu=pd.DataFrame(clm7)

top_insu['State']=top_insu['State'].str.replace('andaman-&-nicobar-islands','Andaman & Nicobar')
top_insu['State']=top_insu['State'].str.replace('-',' ')
top_insu['State']=top_insu['State'].str.title()
top_insu['State']=top_insu['State'].str.replace('Dadra & Nagar Haveli & Daman & Diu','Dadra and Nagar Haveli and Daman and Diu')

In [17]:
top_insu

,State,Year,Quater,Pincodes,Transacion_count,Transacion_amount
0,Andaman & Nicobar,2020,2,744301,3,565.0
1,Andaman & Nicobar,2020,2,744104,2,513.0
2,Andaman & Nicobar,2020,2,744101,1,282.0
3,Andaman & Nicobar,2020,3,744112,9,3432.0
4,Andaman & Nicobar,2020,3,744105,7,3948.0
...,...,...,...,...,...,...
6663,West Bengal,2024,4,711101,713,750354.0
6664,West Bengal,2024,4,700091,642,969634.0
6665,West Bengal,2024,4,700150,627,761501.0
6666,West Bengal,2024,4,700039,619,787836.0
6667,West Bengal,2024,4,700156,574,888613.0

In [18]:
#top trancation

path8="C:/Users/Admin/Downloads/pulse-master/pulse-master/data/top/transaction/country/india/state/"
top_tran_list=os.listdir(path8)
top_tran_list


clm8={'State':[], 'Year':[],'Quater':[],'Pincodes':[], 'Transacion_count':[], 'Transacion_amount':[]}

for i in top_tran_list:
    p_i=path8+i+"/"
    top_yr=os.listdir(p_i)
    for j in top_yr:
        p_j=p_i+j+"/"
        top_yr_list=os.listdir(p_j)
        for k in top_yr_list:
            p_k=p_j+k
            Data=open(p_k,'r')
            H=json.load(Data)
            for z in H['data']['pincodes']:
              entityName=z['entityName']
              count=z['metric']['count']
              amount=z['metric']['amount']
              clm8['Pincodes'].append(entityName)
              clm8['Transacion_count'].append(count)
              clm8['Transacion_amount'].append(amount)
              clm8['State'].append(i)
              clm8['Year'].append(j)
              clm8['Quater'].append(int(k.strip('.json')))
top_tran=pd.DataFrame(clm8)


top_tran['State']=top_tran['State'].str.replace('andaman-&-nicobar-islands','Andaman & Nicobar')
top_tran['State']=top_tran['State'].str.replace('-',' ')
top_tran['State']=top_tran['State'].str.title()
top_tran['State']=top_tran['State'].str.replace('Dadra & Nagar Haveli & Daman & Diu','Dadra and Nagar Haveli and Daman and Diu')

In [19]:
top_tran

,State,Year,Quater,Pincodes,Transacion_count,Transacion_amount
0,Andaman & Nicobar,2018,1,744101,1622,2.769298e+06
1,Andaman & Nicobar,2018,1,744103,1223,2.238042e+06
2,Andaman & Nicobar,2018,1,744102,969,3.519060e+06
3,Andaman & Nicobar,2018,1,744105,685,1.298561e+06
4,Andaman & Nicobar,2018,1,744104,340,1.039715e+06
...,...,...,...,...,...,...
9994,West Bengal,2024,4,711101,6753348,1.049483e+10
9995,West Bengal,2024,4,700059,6662715,8.009476e+09
9996,West Bengal,2024,4,700039,6575693,9.018748e+09
9997,West Bengal,2024,4,734001,6432082,8.996529e+09
9998,West Bengal,2024,4,733134,6313560,1.050259e+10

In [20]:
#top user

path9="C:/Users/Admin/Downloads/pulse-master/pulse-master/data/top/user/country/india/state/"
top_user_list=os.listdir(path9)
top_user_list


clm9={'State':[], 'Year':[],'Quater':[],'Pincodes':[], 'RegisteredUsers':[]}

for i in top_user_list:
    p_i=path9+i+"/"
    top_yr=os.listdir(p_i)
    for j in top_yr:
        p_j=p_i+j+"/"
        top_yr_list=os.listdir(p_j)
        for k in top_yr_list:
            p_k=p_j+k
            Data=open(p_k,'r')
            I=json.load(Data)

            for z in I['data']['pincodes']:
              entityName=z['name']
              registeredUsers=z['registeredUsers']
              clm9['Pincodes'].append(entityName)
              clm9['RegisteredUsers'].append(registeredUsers)
              clm9['State'].append(i)
              clm9['Year'].append(j)
              clm9['Quater'].append(int(k.strip('.json')))

top_user=pd.DataFrame(clm9)

top_user['State']=top_user['State'].str.replace('andaman-&-nicobar-islands','Andaman & Nicobar')
top_user['State']=top_user['State'].str.replace('-',' ')
top_user['State']=top_user['State'].str.title()
top_user['State']=top_user['State'].str.replace('Dadra & Nagar Haveli & Daman & Diu','Dadra and Nagar Haveli and Daman and Diu')

In [21]:
top_user

                  State  Year  Quater Pincodes  RegisteredUsers
0     Andaman & Nicobar  2018       1   744103             1608
1     Andaman & Nicobar  2018       1   744101             1108
2     Andaman & Nicobar  2018       1   744105             1075
3     Andaman & Nicobar  2018       1   744102             1006
4     Andaman & Nicobar  2018       1   744104              272
...                 ...   ...     ...      ...              ...
9995        West Bengal  2024       4   733134           169596
9996        West Bengal  2024       4   700059           169448
9997        West Bengal  2024       4   711302           146034
9998        West Bengal  2024       4   700150           142151
9999        West Bengal  2024       4   711106           142077

[10000 rows x 5 columns]

In [25]:
import pandas as pd
import pyodbc
import sqlalchemy



conn = pyodbc.connect(
    "Driver={SQL Server};"
    "Server=SAM\SQLEXPRESS;"  
    "Database=phonepe1;"
    "Trusted_Connection=yes;"
)

cursor = conn.cursor()

try:
    conn = pyodbc.connect(
        "Driver={SQL Server};"
        "Server=SAM\SQLEXPRESS;"
        "Database=phonepe1;"
        "Trusted_Connection=yes;"
    )
    cursor = conn.cursor()

    cursor.execute("""
    IF NOT EXISTS (SELECT * FROM sysobjects WHERE name='Customers' AND xtype='U')
    CREATE TABLE  Agg_insu (
        State varchar(255),
        Year int,
        Quater int,
        Transacion_type NVARCHAR(255),
        Transacion_count bigint,
        Transacion_amount bigint,
    )
    """)
    conn.commit()
    print("✅ Table checked/created successfully!")

except Exception as e:
    print("❌ Error:", e)
finally:
    cursor.close()
    conn.close()

conn = pyodbc.connect(
      "Driver={SQL Server};"
      "Server=SAM\SQLEXPRESS;"
      "Database=phonepe1;"
      "Trusted_Connection=yes;"
)

cursor = conn.cursor()

# Multiple rows
data =Agg_insu.values.tolist()


insert_query = """
INSERT INTO Agg_insu (State, Year, Quater, Transacion_type, Transacion_count,
                      Transacion_amount)
VALUES (?,?,?,?,?,?)
"""

cursor.executemany(insert_query, data)
conn.commit()

try:
    conn = pyodbc.connect(
        "Driver={SQL Server};"
        "Server=SAM\SQLEXPRESS;"
        "Database=phonepe1;"
        "Trusted_Connection=yes;"
    )
    cursor = conn.cursor()

    cursor.execute("""
    IF NOT EXISTS (SELECT * FROM sysobjects WHERE name='Customers' AND xtype='U')
    CREATE TABLE  Agg_Trans (
        State varchar(255),
        Year int,
        Quater int,
        Transacion_type NVARCHAR(255),
        Transacion_count bigint,
        Transacion_amount bigint,
    )
    """)
    conn.commit()
    print("✅ Table checked/created successfully!")

except Exception as e:
    print("❌ Error:", e)
finally:
    cursor.close()
    conn.close()

conn = pyodbc.connect(
      "Driver={SQL Server};"
      "Server=SAM\SQLEXPRESS;"
      "Database=phonepe1;"
      "Trusted_Connection=yes;"
)

cursor = conn.cursor()

# Multiple rows
data =Agg_Trans.values.tolist()


insert_query_2= """
INSERT INTO Agg_Trans (State, Year, Quater, Transacion_type, Transacion_count,
                      Transacion_amount)
VALUES (?,?,?,?,?,?)
"""

cursor.executemany(insert_query_2, data)
conn.commit()   



try:
    conn = pyodbc.connect(
        "Driver={SQL Server};"
        "Server=SAM\SQLEXPRESS;"
        "Database=phonepe1;"
        "Trusted_Connection=yes;"
    )
    cursor = conn.cursor()

    cursor.execute("""
    IF NOT EXISTS (SELECT * FROM sysobjects WHERE name='Customers' AND xtype='U')
    CREATE TABLE  Agg_user(
        State varchar(255),
        Year int,
        Quater int,
        Brands NVARCHAR(255),
        Transacion_count bigint,
        Percentage float,
    )
    """)
    conn.commit()
    print("✅ Table checked/created successfully!")

except Exception as e:
    print("❌ Error:", e)
finally:
    cursor.close()
    conn.close()


conn = pyodbc.connect(
      "Driver={SQL Server};"
      "Server=SAM\SQLEXPRESS;"
      "Database=phonepe1;"
      "Trusted_Connection=yes;"
)

cursor = conn.cursor()

# Multiple rows
data =Agg_user.values.tolist()


insert_query_3= """
INSERT INTO Agg_user (State, Year, Quater, Brands, Transacion_count,
                      Percentage)
VALUES (?,?,?,?,?,?)
"""

cursor.executemany(insert_query_3, data)
conn.commit()

    
try:
    conn = pyodbc.connect(
        "Driver={SQL Server};"
        "Server=SAM\SQLEXPRESS;"
        "Database=phonepe1;"
        "Trusted_Connection=yes;"
    )
    cursor = conn.cursor()

    cursor.execute("""
    IF NOT EXISTS (SELECT * FROM sysobjects WHERE name='Customers' AND xtype='U')
    CREATE TABLE  map_insu(
        State varchar(255),
        Year int,
        Quater int,
        Districts NVARCHAR(255),
        Transacion_count bigint,
        Transacion_amount bigint,
    )
    """)
    conn.commit()
    print("✅ Table checked/created successfully!")

except Exception as e:
    print("❌ Error:", e)
finally:
    cursor.close()
    conn.close()    


conn = pyodbc.connect(
      "Driver={SQL Server};"
      "Server=SAM\SQLEXPRESS;"
      "Database=phonepe1;"
      "Trusted_Connection=yes;"
)

cursor = conn.cursor()

# Multiple rows
data =map_insu.values.tolist()


insert_query_4 = """
INSERT INTO map_insu (State, Year, Quater, Districts, Transacion_count,
                      Transacion_amount)
VALUES (?,?,?,?,?,?)
"""

cursor.executemany(insert_query_4, data)
conn.commit()


try:
    conn = pyodbc.connect(
        "Driver={SQL Server};"
        "Server=SAM\SQLEXPRESS;"
        "Database=phonepe1;"
        "Trusted_Connection=yes;"
    )
    cursor = conn.cursor()

    cursor.execute("""
    IF NOT EXISTS (SELECT * FROM sysobjects WHERE name='Customers' AND xtype='U')
    CREATE TABLE  map_tran(
        State varchar(255),
        Year int,
        Quater int,
        Districts NVARCHAR(255),
        Transacion_count bigint,
        Transacion_amount bigint,
    )
    """)
    conn.commit()
    print("✅ Table checked/created successfully!")

except Exception as e:
    print("❌ Error:", e)
finally:
    cursor.close()
    conn.close()

conn = pyodbc.connect(
      "Driver={SQL Server};"
      "Server=SAM\SQLEXPRESS;"
      "Database=phonepe1;"
      "Trusted_Connection=yes;"
)

cursor = conn.cursor()

# Multiple rows
data =map_tran.values.tolist()


insert_query_5 = """
INSERT INTO map_tran (State, Year, Quater, Districts, Transacion_count,
                      Transacion_amount)
VALUES (?,?,?,?,?,?)
"""

cursor.executemany(insert_query_5, data)
conn.commit()    


try:
    conn = pyodbc.connect(
        "Driver={SQL Server};"
        "Server=SAM\SQLEXPRESS;"
        "Database=phonepe1;"
        "Trusted_Connection=yes;"
    )
    cursor = conn.cursor()

    cursor.execute("""
    IF NOT EXISTS (SELECT * FROM sysobjects WHERE name='Customers' AND xtype='U')
    CREATE TABLE  map_user(
        State varchar(255),
        Year int,
        Quater int,
        Districts NVARCHAR(255),
        RegisteredUsers bigint,
        AppOpens bigint,
    )
    """)
    conn.commit()
    print("✅ Table checked/created successfully!")

except Exception as e:
    print("❌ Error:", e)
finally:
    cursor.close()
    conn.close()

conn = pyodbc.connect(
      "Driver={SQL Server};"
      "Server=SAM\SQLEXPRESS;"
      "Database=phonepe1;"
      "Trusted_Connection=yes;"
)

cursor = conn.cursor()

# Multiple rows
data =map_user.values.tolist()


insert_query_6 = """
INSERT INTO map_user (State, Year, Quater, Districts, RegisteredUsers,
                      AppOpens)
VALUES (?,?,?,?,?,?)
"""

cursor.executemany(insert_query_6, data)
conn.commit()    


try:
    conn = pyodbc.connect(
        "Driver={SQL Server};"
        "Server=SAM\SQLEXPRESS;"
        "Database=phonepe1;"
        "Trusted_Connection=yes;"
    )
    cursor = conn.cursor()

    cursor.execute("""
    IF NOT EXISTS (SELECT * FROM sysobjects WHERE name='Customers' AND xtype='U')
    CREATE TABLE  top_insu(
        State varchar(255),
        Year int,
        Quater int,
        Pincodes int,
        Transacion_count bigint,
        Transacion_amount bigint,
    )
    """)
    conn.commit()
    print("✅ Table checked/created successfully!")

except Exception as e:
    print("❌ Error:", e)
finally:
    cursor.close()
    conn.close()


conn = pyodbc.connect(
      "Driver={SQL Server};"
      "Server=SAM\SQLEXPRESS;"
      "Database=phonepe1;"
      "Trusted_Connection=yes;"
)

cursor = conn.cursor()

# Multiple rows
data =top_insu.values.tolist()


insert_query_7 = """
INSERT INTO top_insu (State, Year, Quater, Pincodes, Transacion_count,
                      Transacion_amount)
VALUES (?,?,?,?,?,?)
"""

cursor.executemany(insert_query_7, data)
conn.commit()

try:
    conn = pyodbc.connect(
        "Driver={SQL Server};"
        "Server=SAM\SQLEXPRESS;"
        "Database=phonepe1;"
        "Trusted_Connection=yes;"
    )
    cursor = conn.cursor()

    cursor.execute("""
    IF NOT EXISTS (SELECT * FROM sysobjects WHERE name='Customers' AND xtype='U')
    CREATE TABLE  top_tran(
        State varchar(255),
        Year int,
        Quater int,
        Pincodes int,
        Transacion_count bigint,
        Transacion_amount bigint,
    )
    """)
    conn.commit()
    print("✅ Table checked/created successfully!")

except Exception as e:
    print("❌ Error:", e)
finally:
    cursor.close()
    conn.close()


conn = pyodbc.connect(
      "Driver={SQL Server};"
      "Server=SAM\SQLEXPRESS;"
      "Database=phonepe1;"
      "Trusted_Connection=yes;"
)

cursor = conn.cursor()

# Multiple rows
data =top_tran.values.tolist()


insert_query_8 = """
INSERT INTO top_tran (State, Year, Quater, Pincodes, Transacion_count,
                      Transacion_amount)
VALUES (?,?,?,?,?,?)
"""

cursor.executemany(insert_query_8, data)
conn.commit()    


try:
    conn = pyodbc.connect(
        "Driver={SQL Server};"
        "Server=SAM\SQLEXPRESS;"
        "Database=phonepe1;"
        "Trusted_Connection=yes;"
    )
    cursor = conn.cursor()

    cursor.execute("""
    IF NOT EXISTS (SELECT * FROM sysobjects WHERE name='Customers' AND xtype='U')
    CREATE TABLE  top_user(
        State varchar(255),
        Year int,
        Quater int,
        Pincodes int,
        RegisteredUsers bigint,
    )
    """)
    conn.commit()
    print("✅ Table checked/created successfully!")

except Exception as e:
    print("❌ Error:", e)
finally:
    cursor.close()
    conn.close()

conn = pyodbc.connect(
      "Driver={SQL Server};"
      "Server=SAM\SQLEXPRESS;"
      "Database=phonepe1;"
      "Trusted_Connection=yes;"
)

cursor = conn.cursor()

# Multiple rows
data =top_user.values.tolist()


insert_query_9 = """
INSERT INTO top_user (State, Year, Quater, Pincodes, RegisteredUsers)
VALUES (?,?,?,?,?)
"""

cursor.executemany(insert_query_9, data)
conn.commit()

❌ Error: ('42S01', "[42S01] [Microsoft][ODBC SQL Server Driver][SQL Server]There is already an object named 'Agg_insu' in the database. (2714) (SQLExecDirectW)")
❌ Error: ('42S01', "[42S01] [Microsoft][ODBC SQL Server Driver][SQL Server]There is already an object named 'Agg_Trans' in the database. (2714) (SQLExecDirectW)")
❌ Error: ('42S01', "[42S01] [Microsoft][ODBC SQL Server Driver][SQL Server]There is already an object named 'Agg_user' in the database. (2714) (SQLExecDirectW)")
❌ Error: ('42S01', "[42S01] [Microsoft][ODBC SQL Server Driver][SQL Server]There is already an object named 'map_insu' in the database. (2714) (SQLExecDirectW)")
❌ Error: ('42S01', "[42S01] [Microsoft][ODBC SQL Server Driver][SQL Server]There is already an object named 'map_tran' in the database. (2714) (SQLExecDirectW)")
❌ Error: ('42S01', "[42S01] [Microsoft][ODBC SQL Server Driver][SQL Server]There is already an object named 'map_user' in the database. (2714) (SQLExecDirectW)")
❌ Error: ('42S01', "[42S01] [Microsoft][ODBC SQL Server Driver][SQL Server]There is already an object named 'top_insu' in the database. (2714) (SQLExecDirectW)")
❌ Error: ('42S01', "[42S01] [Microsoft][ODBC SQL Server Driver][SQL Server]There is already an object named 'top_tran' in the database. (2714) (SQLExecDirectW)")
❌ Error: ('42S01', "[42S01] [Microsoft][ODBC SQL Server Driver][SQL Server]There is already an object named 'top_user' in the database. (2714) (SQLExecDirectW)")

In [1]:
import pyodbc

conn = pyodbc.connect(
    r"DRIVER={SQL Server};"
    r"SERVER=SAM\SQLEXPRESS;"
    r"DATABASE=phonepe1;"
    r"Trusted_Connection=yes;"
)

cursor = conn.cursor()
print("Connected successfully!")

Connected successfully!